{
    "user":{
        "name":"Prem Prakash Gupta",
        "profile":"Software Developer",
        "about":"Experienced Full Stack Developer with proficiency in MERN stack and Flutter. Specializing in building robust and scalable web applications and mobile solutions. Adept at collaborating with cross-functional teams to deliver innovative and user-friendly products. Passionate about creating seamless, efficient, and cutting-edge software experiences",
        "title":"Hello",
        "subtitle":"Here's who I am & what I do",
        "linkedIn":"https://www.linkedin.com/in/premprakashgupta-/",
        "instagram":"",
        "github":"https://github.com/premprakashgupta/",
        "email":"prem.com0011@gmail.com"
        
    },
    "resume":[
        {
          "title": "Experience",
          "btn": true,
          "children": [
            {
              "duration": "Feb-2024 to present",
              "name": "KartDaddy Online Service",
              "profile": "Software Engineer (Flutter)",
              "location": "Prayagraj (Allahabad)",
              "link": "https://kartdaddy.in/",
              "desc": "Dedicated and skilled professional with expertise in Flutter and Laravel technologies, currently employed full-time at KartDaddy. Demonstrated proficiency in developing innovative and efficient solutions, contributing to the success of projects. Proven ability to work effectively in a team environment and deliver high-quality results within specified timelines. Adept at leveraging both Flutter and Laravel to create dynamic and responsive applications, showcasing strong problem-solving and analytical skills. Committed to staying current with industry trends and continuously expanding knowledge in the rapidly evolving field of technology"
            },
            {
              "duration": "Oct-2023 to Jan-2024",
              "name": "MittArv Technology Pvt. Ltd",
              "profile": "Software Engineer (Flutter & Mern)",
              "location": "Hyerabad",
              "link": "https://www.mittarv.com/",
              "desc": "Energetic and resourceful professional with a full-time internship at Mittarv Technology Pvt Ltd, specializing in Flutter and Full-Stack development (MERN). Hands-on experience in creating dynamic and user-friendly applications using Flutter for the front end and mastering the MERN (MongoDB, Express.js, React.js, Node.js) stack for comprehensive full-stack development. Demonstrated ability to collaborate effectively within a team, contribute to project success, and adapt quickly to emerging technologies. Proven problem-solving and analytical skills, combined with a commitment to delivering high-quality results. A proactive learner, staying abreast of the latest industry trends and consistently expanding expertise in the tech landscape"
            }
          ]
        },
        {
          "title": "Education",
          "children": [
            {
              "duration": "Sep-2019 to Sep-2023",
              "name": "Nalanda College of Engineering",
              "profile": "B.Tech (Computer Science & Engineering)",
              "location": "Nalanda",
              "desc": "Motivated Computer Science and Engineering student pursuing a BTech degree with a strong foundation in technology, specializing in a 2-year comprehensive understanding of the MERN stack and 1-year experience with Flutter. Recognized as the 2nd runner-up in the Sershah Web-thon 2022, showcasing problem-solving prowess and creative thinking. Adept at organizing and coordinating events, served as the coordinator for LaTeX classes organized by IIT Kanpur and NCE. Engaged as a speaker in a web development seminar hosted by my college, demonstrating effective communication and leadership skills. Successfully organized a coding competition sponsored by Internshala and Coding Ninja, highlighting organizational and teamwork abilities. A proactive learner and dynamic individual, consistently contributing to the tech community and expanding knowledge in the field.",
              "link": "https://ncechandi.ac.in/"
            },
            {
              "duration": "May-2016 to May-2018",
              "name": "Hariram College, mairwa Dham",
              "profile": "Science (PCM)",
              "location": "Mairwa",
              "desc": "Diligent student with a strong academic background, having studied Physics, Chemistry, and Mathematics (PCM) at HR College, Mairwa. Achieved the position of college topper with an impressive 62.6%, showcasing a commitment to academic excellence. This accomplishment reflects strong analytical and problem-solving abilities, along with a dedicated approach to studies. A well-rounded individual with a solid foundation in science, eager to apply academic achievements to real-world challenges in the field of technology or related areas.",
              "link": "#"
            }
          ]
        }
      ],
      "project":[
        {
          "title": "On MERN-Stack",
          "children": [
            {
              "name": "Netflix Design",
              "skills": [
                { "color": "#479848", "text": "tailwind css" },
                { "color": "#235E8B", "text": "ReactJs" }
                
              ],
    
              "link": "https://63199abc38a3cd4a9cf9b9b5--studyflix.netlify.app/",
              "desc": "Crafted a faithful frontend clone of Netflix, incorporating engaging design elements and user-friendly functionalities"
            },
            
            {
              "name": "SunShine E-Commerce",
              "skills": [
                { "color": "#479848", "text": "MongoDb" },
                { "color": "#373737", "text": "ExpressJs" },
                { "color": "#373737", "text": "Redux" },
                { "color": "#235E8B", "text": "ReactJs" },
                { "color": "#74B141", "text": "NodeJs" }
              ],
    
              "link": "https://sunshine-server.onrender.com/",
              "desc": "Spearheaded the development of a comprehensive e-commerce platform, featuring a range of functionalities like add-to-cart, review posting, and seamless purchase processes"
            },
            {
              "name": "Resume Builder",
              "skills": [
                { "color": "#479848", "text": "tailwind css" },
                { "color": "#235E8B", "text": "ReactJs" }
                
              ],
    
              "link": "https://resume4u.netlify.app/",
              "desc": "Conceptualized and implemented a user-friendly resume builder application, allowing users to create and download resumes effortlessly"
            },
            {
              "name": "Instagram Clone",
              "skills": [
                { "color": "#479848", "text": "MongoDb" },
                { "color": "#373737", "text": "ExpressJs" },
                { "color": "#235E8B", "text": "ReactJs" },
                { "color": "#74B141", "text": "NodeJs" }
              ],
    
              "link": "https://github.com/premprakashgupta/preminsta",
              "desc": "Led the development of an Instagram clone with a full suite of features, including post uploads, likes-dislikes, and friend request functionalities"
            },
            {
              "name": "Web-Editor",
              "skills": [
                
                { "color": "#235E8B", "text": "ReactJs" }
                
              ],
    
              "link": "https://webeditor4u.netlify.app/",
              "desc": "Designed and implemented a web-based editor tool akin to Notepad, catering to various user needs"
            },
            {
              "name": "WhatsApp Clone",
              "skills": [
                
                { "color": "#479848", "text": "MongoDb" },
                { "color": "#373737", "text": "ExpressJs" },
                { "color": "#235E8B", "text": "ReactJs" },
                { "color": "#74B141", "text": "NodeJs" },
                { "color": "#373737", "text": "Socket.IO" }
                
              ],
    
              "link": "https://github.com/premprakashgupta",
              "desc": "WhatsApp clone with all feature like person to person chat, group chat and change profile and status."
            },
            {
              "name": "Sticky Note",
              "skills": [
                
                { "color": "#479848", "text": "MongoDb" },
                { "color": "#373737", "text": "ExpressJs" },
                { "color": "#235E8B", "text": "ReactJs" },
                { "color": "#74B141", "text": "NodeJs" }
                
              ],
    
              "link": "https://github.com/premprakashgupta/",
              "desc": "A website which collect your all colorfull sticky note, just login and see what is next to go. Also ou can play with sticky notes"
            }
            
          ]
        },
        {
          "title": "On Flutter",
          "children": [
            {
              "name": "Dr. Ai",
              "skills": [
                { "color": "#235E8B", "text": "Flutter" },
                { "color": "#479848", "text": "Firebase" },
                { "color": "#373737", "text": "Ai/ML" },
                { "color": "#373737", "text": "Socket.Io" },
                { "color": "#74B141", "text": "Redis" }
              ],
    
              "desc": " Pioneered the development of an innovative healthcare application powered by artificial intelligence, connecting users with advanced medical insights",
              "link": "https://github.com/premprakashgupta/myproject"
            },
            {
              "name": "E-Commerce",
              "skills": [
                { "color": "#235E8B", "text": "Flutter" },
                { "color": "#479848", "text": "Firebase" },
                { "color": "#373737", "text": "Rest API" },
                { "color": "#74B141", "text": "Providers" }
              ],
    
              "desc": "Architected a feature-rich Flutter-based e-commerce application, integrating seamlessly with REST APIs and leveraging Provider architecture for enhanced functionality",
              "link": "https://github.com/premprakashgupta/e_commerce_using_flutter"
            },
            {
              "name": "Code Discussion",
              "skills": [
                { "color": "#235E8B", "text": "Flutter" },
                { "color": "#479848", "text": "Firebase" },
                { "color": "#74B141", "text": "Getx" }
              ],
    
              "desc": "Architected a feature-rich Flutter-based Educational application, which provide plateform to discussion of code for students. students can solve PYQ of various exams and get immediate result.",
              "link": "https://github.com/premprakashgupta"
            },
            {
              "name": "Make Attendance",
              "skills": [
                { "color": "#235E8B", "text": "Flutter" },
                { "color": "#479848", "text": "Firebase" },
                { "color": "#74B141", "text": "Getx" }
              ],
    
              "desc": "Architected a feature-rich Flutter-based Educational application, which provide facility to make attendance of students and provide them assignments",
              "link": "https://github.com/premprakashgupta/attendance"
            }
          ]
        }
      ]

}
